[
  {
    "qaid": "SOLAREDGEMONITOR",
    "version": "4.1",
    "changelog": "- Added PowerFlow query with extra childs for Grid (kW), Load (kW), PV (kW), Storage (kW) and Storage percentage. The childs can be created by setting the QuickApp Variable 'powerFlow' to true. These child give an insight on how many power flows from or to the Grid, Load and Storage, how many power flows from the PV and shows the percentage of the Storage. If Storage drops below 10%, 'Storage critical❗️' will be shown in de log text. <br />- Combined the Software and Technical data query with one button an run the query outsite the API. <br />- Rounded the Current Power, Solar Power and Lifetime Energy in the labels. <br />- Formatted the Last Update Date for the Optimizer/Panel values. <br />- Added a new button to show all credentials siteID, apiKey, serialNumber, reporterID, username and password in a label. Please handle this button with care to keep your credentials secure. You can turn this button on and off with the QuickApp Variable 'credButton' (default = false). The credentials will only show for 4 seconds. <br />- Added a new button to show help on the settings of the Quickapp Variables. <br />- Improved the warning and debug message of the panel request, added the panel number to the warning and debug message.  <br /> "
  },
  {
    "qaid": "SOLAREDGELIVE",
    "version": "1.2",
    "changelog": "- Changed the main device type to com.fibaro.powerMeter, so it can contain the AC Power value. <br /> - Added QuickApp variable for the main device register, mainRegister (default = 40084 AC Power). <br /> - Added default don't 'Save events to History' (saveLogs = false) to the setup of every child device. <br /> - Disabled the warnings for READ, WRITE and Invalid response. Users can't prevent those errors and to display them as warnings only clutters the logging. <br /> - Changed the text of the interval speed buttons to the content of the quickapp variables intervalChildsS, intervalChildsM and intervalChildsF. <br /> - Found a few old SolarEdge Modbus QuickApp names in the code and changed them also to SolarEdge Live. <br /> - Optimised the register mapping. <br /> - Changed the default interval timing to 60, 10 and 5 seconds. Of course, you can use your own settings. <br /> - Removed the expiration date. <br /> "
  },
  {
    "qaid": "TIBBERMONITOR",
    "version": "5.0",
    "changelog": "- QUARTER-HOURLY PRICES: Adjusted the price calculations for today and tomorrow prices to quarter-hourly prices (starting the 1st of October 2025). <br />- Removed all child devices for today and tomorrow hourly prices. <br />- Removed all hourly global variables for today and tomorrow hourly levels and hourly percentages. <br />- Added a global variable for today prices (for energy, tax and total price), percentages, levels, time and startsAt in json format. <br />- Added a second global variable for tomorrow prices (for energy, tax and total price), percentages, levels, time and startsAt in json format.<br />- Changed the interval from 60 minutes to 15 minutes. <br />- Prices are only requested once a day, but if not available, the request will be repeated every 15 minutes untill the prices are available. <br />- Removed the secondsH quickapp variable (How many seconds after the whole hour should the QuickApp run). With the quarter-hourly interval and retry function no longer needed. <br />- The consumption and production values are retrieved every quarter past the whole hour (because at the whole hour, the consumption and production values aren't available yet). <br />- Changed the device type of Total Consumption and Total Production to multilevelSensor, so they can't be uses for the energy panel anymore. Tibber Monitor gets consumption and production values from the Tibber API that are one hour old. Please use Tibber Live or any other realtime QuickApp to insert consumption and production values in your energy panel. <br />- Removed the currentPrice, workaroundPnn, workaroundP95, workaroundE01 and workaroundC01 QuickApp Variable, because they are no longer needed (no consumption and production in energy panel). <br />- Gas Prices are only requested at 18:00 util the tomorrow Gas price is available. <br />- Changed all prices (also gas) to cents, all energy cost (consumption, production) are still in your currency. <br />- Added a new QuickApp variable showTax. If true then the prices will include all taxes (default = true), otherwise the prices are shown without taxes. <br />- Changed the value of the Today Gas Price if showTax is true, then the price will not only get the Vat, but also the gas Purchasing cost and the gas Tax. So the child device will represent the total gas price per m³ (if showTax is true). Otherwise the gas price will be without any form of tax. <br />- Limited the graphs to a minimum of one block, so it will show always one block minimum. Negative prices will show as one block. <br />- Added an extra color to the graphs for negative prices. <br />- Added a new button to show all credentials like the token and Home ID in a label. Please handle this button with care to keep your credentials secure. You can turn this button on and off with the QuickApp Variable 'credButton' (default = false). The credentials will only show for 4 seconds, long enough for you to copy them. <br />- Added a new Help button to show info on the settings of the Quickapp Variables. <br />- Replaced the child framework with a new framework. <br />- Made the child device for Gas dynamic. The child device Gas is only created if the QuickApp variable 'energyZero' is true. The child will be removed is you change true to false. <br />- Rounded the (today and tomorrow) price percentages in the labels to one digid to save some space in the labels to keep it on one line. <br />- Removed the Price Rating button. The other type of price field available in the API, Subscription.priceRating, will not support quarter-hourly prices, and is henceforth deprecated by Tibber.  <br />"
  },
  {
    "qaid": "TIBBERLIVE",
    "version": "4.0",
    "changelog": "- Added child for Accumulated Reward (todays reward for energy production).  <br />- Added child for Net Profit (todays reward for energy production minus todays cost for energy consumption).  <br />- Added more functions to fully disable the quickapp. If the QuickApp is disabled by the user, now also the buttons and fibaro calls are disabled. <br />- Added buttons to disconnect and connect webSocket session.  <br />- Changed the behaviour of connecting to the Tibber WebSocket. After the maximum reconnects (10), the QuickApp disconnects and sends a notification to the Tibber iOS or Android app. The Tibber user gets better informed and can take action.  <br />- Removed the reconnect QuickApp variable, not necessary to get changed by the Tibber user, it is now hardcoded (and the value is still 10 reconnects).  <br />- Added check if realtime consumption (Tibber Pulse is working) is enabled at startup of the QuickApp and when reconnecting the QuickApp. If the Tibber Pulse is not available, not working, then the QuickApp will go in disconnected status and in the labels the Tibber user can see the reason.  <br />- Added Net Profit (todays reward for energy production minus todays cost for energy consumption) to the labels.  <br />- Placed the average power consumption (Watt) more prominent in the labels.  <br />- Added Tibber Server responses to the labels (they were already in de debuglogging) so the Tibber users gets better informed about the connection status.  <br />- Added the check for a new QuickApp version. The user gets notified in the Fibaro Notifications of the new QuickApp with the changelog.  <br />- Changed the debuglevels a bit, so you can see the connection statusses already in debuglevel 2.  <br />- Changed QuickApp variabels 'token' and 'homeId' to secret (stored encrypted) so they cannot get shown or published unintentionally.  <br />- Added dynamic Tibber Live webSocket URL (at startup the QuickApp gets the current webSocket URL), so the QuickApp is future proof in case the WebSocket URL gets changed.  <br />- Removed both simulation modes (debugLevel 4 and 5).  <br />"
  }, 
  {
    "qaid": "TIBBERTRIGGER",
    "version": "2.0",
    "changelog": "- QUARTER-HOURLY PRICES: Adjusted the Tibber Trigger QuickApp to the quarter-hourly prices. Tibber Trigger doesn't use the Tibber Monitor childs anymore, but now uses two Tibber Monitor global variables, one for all the today prices and one for all the tomorrow prices. <br />- Added lots of small improvements, like:<br />- Extra: at midnight when the timeslot is running, tomorrow prices change to today prices and today prices change to yesterday prices. <br />- Added extra handling of existance of the global variables for today en tomorrow prices. <br />- Added the date of the last price check to the labels. <br />- Added a new QuickApp variable showTax. If true then the prices will include all taxes (default = true), otherwise without taxes.  <br />"
  }, 
  {
    "qaid": "AIRQUALITYOWM",
    "version": "2.0",
    "changelog": "- Solved an bug when OpenWeatherMap gave an empty result <br />- Change code to multifile <br />"
  },
  {
    "qaid": "ZWAVEANALYZER",
    "version": "0.96",
    "changelog": "- Added Neighbor List button to show the neighbor devices <br />- Added Clear button to reset all buttons, switch statuses and labels <br />- Added Last Working Route Response Timestamp to the 'route' labels <br />- Added more translation text for the labels <br />"
  },
  {
    "qaid": "ZWAVEROUTE",
    "version": "0.96",
    "changelog": "- Added Neighbor List button to show the neighbor devices <br />- Added Clear button to reset all buttons, switch statuses and labels <br />- Added Last Working Route Response Timestamp to the 'route' labels <br />- Added more translation text for the labels <br />"
  },
  {
    "qaid": "SOLAREDGEMODBUS",
    "version": "1.2",
    "changelog": "- Changed the main device type to com.fibaro.powerMeter, so it can contain the AC Power value. <br /> - Added QuickApp variable for the main device register, mainRegister (default = 40084 AC Power). <br /> - Added default don't 'Save events to History' (saveLogs = false) to the setup of every child device. <br /> - Disabled the warnings for READ, WRITE and Invalid response. Users can't prevent those errors and to display them as warnings only clutters the logging. <br /> - Changed the text of the interval speed buttons to the content of the quickapp variables intervalChildsS, intervalChildsM and intervalChildsF. <br /> - Found a few old SolarEdge Modbus QuickApp names in the code and changed them also to SolarEdge Live. <br /> - Optimised the register mapping. <br /> - Changed the default interval timing to 60, 10 and 5 seconds. Of course, you can use your own settings. <br /> - Removed the expiration date. <br /> "
  }
]
