[
  {
    "qaid": "SOLAREDGEMONITOR",
    "version": "3.2",
    "changelog": "- Added button for Optimizer info <br />- Added button for Software info <br />- Added username and password to quickapp variables to enable 'Optimizer' and 'Software' request <br />- Added reporterID to quickapp variables to enable 'Software' request <br />- Added automaticaly retrieval of the Serial Number with the 'Inventory' function (just like Reporter ID with the 'Optimizer' function) <br />- Changed API key to secret quickapp variable (just like password) <br />- Improved some translations <br />- Solved a bug when technical, storage and meters data wasn't available (for example just after midnight) <br />- Solved error in diabled quickapp. If quickapp is disabled, now also the buttons and fibaro calls are disabled. <br />- Increased the default inverval time from 360 to 300 seconds <br />- Added update available notification <br />"
  },
  {
    "qaid": "AIRQUALITYOWM",
    "version": "2.0",
    "changelog": "- Solved an bug when OpenWeatherMap gave an empty result <br />- Change code to multifile <br />"
  },
  {
    "qaid": "ZWAVEANALYZER",
    "version": "0.96",
    "changelog": "- Added Neighbor List button to show the neighbor devices <br />- Added Clear button to reset all buttons, switch statuses and labels <br />- Added Last Working Route Response Timestamp to the 'route' labels <br />- Added more translation text for the labels <br />"
  },
  {
    "qaid": "ZWAVEROUTE",
    "version": "0.96",
    "changelog": "- Added Neighbor List button to show the neighbor devices <br />- Added Clear button to reset all buttons, switch statuses and labels <br />- Added Last Working Route Response Timestamp to the 'route' labels <br />- Added more translation text for the labels <br />"
  },
  {
    "qaid": "TIBBERMONITOR",
    "version": "4.0",
    "changelog": "- Added Tibber Production values to the labels. <br />- Added Production Child devices for: <br /> - Hour-1 Production (production of the previous hour) <br />- Daily Production (production in kWh)<br />- Monthly Production (production in kWh) <br />- Yearly Production (production in kWh) <br />- Total Production (production in kWh, devicetype com.fibaro.energyMeter and automatic rateType=production for Fibaro Energy Panel) <br />- Added buttons to filter the labels in Prices, Prices Today, Prices Tomorrow, Consumption, Production and Reset (show all label content). <br />- Added nice graphs for today and tomorrow prices with the 🟩🟨🟧🟥🟪 colors. <br />- Added nice graphs for energy consumption and production with 🟧🟩 colors. <br />- Added QuickApp variable to enable Energy Zero gas prices. <br />- Changed the Global Variables percentage to number, so there in no more double quote. Please check your scenes if they need any changes! <br />"
  },
  {
    "qaid": "TIBBERLIVE",
    "version": "3.1",
    "changelog": "- Added check for QuickApp update <br />"
  }
]
