[
  {
    "qaid": "SOLAREDGEMONITOR",
    "version": "4.1",
    "changelog": "- Added PowerFlow query with extra childs for Grid (kW), Load (kW), PV (kW), Storage (kW) and Storage percentage. The childs can be created by setting the QuickApp Variable 'powerFlow' to true. These child give an insight on how many power flows from or to the Grid, Load and Storage, how many power flows from the PV and shows the percentage of the Storage. If Storage drops below 10%, 'Storage critical❗️' will be shown in de log text. <br />- Combined the Software and Technical data query with one button an run the query outsite the API. <br />- Rounded the Current Power, Solar Power and Lifetime Energy in the labels. <br />- Formatted the Last Update Date for the Optimizer/Panel values. <br />- Added a new button to show all credentials siteID, apiKey, serialNumber, reporterID, username and password in a label. Please handle this button with care to keep your credentials secure. You can turn this button on and off with the QuickApp Variable 'credButton' (default = false). The credentials will only show for 4 seconds. <br />- Added a new button to show help on the settings of the Quickapp Variables. <br />- Improved the warning and debug message of the panel request, added the panel number to the warning and debug message.  <br /> "
  },
  {
    "qaid": "SOLAREDGEMODBUS",
    "version": "1.0",
    "changelog": "- Initial version with child devices for addresses to configure in QuickApp Variables.  <br /> "
  },
  {
    "qaid": "SOLAREDGELIVE",
    "version": "2.0",
    "changelog": "- Second version of the SolarEdge Live QuickApp using the SolarEdge Modbus.  <br /> "
  },
  {
    "qaid": "AIRQUALITYOWM",
    "version": "2.0",
    "changelog": "- Solved an bug when OpenWeatherMap gave an empty result <br />- Change code to multifile <br />"
  },
  {
    "qaid": "ZWAVEANALYZER",
    "version": "0.96",
    "changelog": "- Added Neighbor List button to show the neighbor devices <br />- Added Clear button to reset all buttons, switch statuses and labels <br />- Added Last Working Route Response Timestamp to the 'route' labels <br />- Added more translation text for the labels <br />"
  },
  {
    "qaid": "ZWAVEROUTE",
    "version": "0.96",
    "changelog": "- Added Neighbor List button to show the neighbor devices <br />- Added Clear button to reset all buttons, switch statuses and labels <br />- Added Last Working Route Response Timestamp to the 'route' labels <br />- Added more translation text for the labels <br />"
  },
    {
    "qaid": "TIBBERTRIGGER",
    "version": "1.1",
    "changelog": "- Added start and end time to the log text <br />- Changed the maximum durationHours to 24 hours <br />"
  },
  {
    "qaid": "TIBBERMONITOR",
    "version": "4.2",
    "changelog": "Solved a bug with the child device for tomorrow 18:00 hour and a bug with creation of double child devices in the Homecenter beta firmware. <br />"
  },
  {
    "qaid": "TIBBERLIVE",
    "version": "4.0",
    "changelog": "- Added child for Accumulated Reward (todays reward for energy production).  <br />- Added child for Net Profit (todays reward for energy production minus todays cost for energy consumption).  <br />- Added more functions to fully disable the quickapp. If the QuickApp is disabled by the user, now also the buttons and fibaro calls are disabled. <br />- Added buttons to disconnect and connect webSocket session.  <br />- Changed the behaviour of connecting to the Tibber WebSocket. After the maximum reconnects (10), the QuickApp disconnects and sends a notification to the Tibber iOS or Android app. The Tibber user gets better informed and can take action.  <br />- Removed the reconnect QuickApp variable, not necessary to get changed by the Tibber user, it is now hardcoded (and the value is still 10 reconnects).  <br />- Added check if realtime consumption (Tibber Pulse is working) is enabled at startup of the QuickApp and when reconnecting the QuickApp. If the Tibber Pulse is not available, not working, then the QuickApp will go in disconnected status and in the labels the Tibber user can see the reason.  <br />- Added Net Profit (todays reward for energy production minus todays cost for energy consumption) to the labels.  <br />- Placed the average power consumption (Watt) more prominent in the labels.  <br />- Added Tibber Server responses to the labels (they were already in de debuglogging) so the Tibber users gets better informed about the connection status.  <br />- Added the check for a new QuickApp version. The user gets notified in the Fibaro Notifications of the new QuickApp with the changelog.  <br />- Changed the debuglevels a bit, so you can see the connection statusses already in debuglevel 2.  <br />- Changed QuickApp variabels 'token' and 'homeId' to secret (stored encrypted) so they cannot get shown or published unintentionally.  <br />- Added dynamic Tibber Live webSocket URL (at startup the QuickApp gets the current webSocket URL), so the QuickApp is future proof in case the WebSocket URL gets changed.  <br />- Removed both simulation modes (debugLevel 4 and 5).  <br />"
  }
]
